# Pandas Assignment Advance - 1

Q1. List any five functions of the pandas library with execution.

In [12]:
#Answer
# five commonly use functions in pandas are -
# 1. read_csv
# 2. head()
# 3. describe()
# 4. info()
# 5. isnull().sum()

# Executing all the five functions ---

# 1.
import pandas as pd
df = pd.read_csv("titanic.csv")

In [13]:
# 2.
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [14]:
# 3. 
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [15]:
# 4.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null object
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null object
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 67.9+ KB

In [18]:
# 5.
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [27]:
df1 = pd.DataFrame({"A":[3,8,6,2,9],
                  "B": [5,2,9,3,1],
                  "C": [1,7,4,5,2]})
df1

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [29]:
#Answer
#creating the function to reindex the dataframe
def re_indexing(df):
    df.reset_index(drop = True)
    df.index = df1.index*2+1
    return df

In [33]:
re_indexing(df)

   A  B  C
1  3  5  1
3  8  2  7
5  6  9  4
7  2  3  5
9  9  1  2

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [35]:
#Answer
df2 = pd.DataFrame({'Values':[10,20,30,40,50]})
def summ(df2):
    return df2["Values"][0:3].sum()
result = summ(df2)
result

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [36]:
#Answer
df = pd.DataFrame({'Text':['Hope you are doing well', 'I am learning data science today', 'love to see you well tonight']})
df

                               Text
0           Hope you are doing well
1  I am learning data science today
2      love to see you well tonight

In [38]:
df['Word_Count'] = df['Text'].apply(lambda x : len(x.split()))
df

                               Text  Word_Count
0           Hope you are doing well           5
1  I am learning data science today           6
2      love to see you well tonight           6

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [ ]:
# Answer
## DataFrame.size()

# The size property is used to get an int representing the number of elements in this object and Return the number of rows if 
# Series. Otherwise, return the number of rows times the number of columns if DataFrame.
# DataFrame.Size() gives the total number of elements in DataFrame.


## DataFrame.shape()

# DataFrame.shape:DataFrame.shape returns a tuple that represents the dimensions of the DataFrame.
# The tuple contains two elements: the number of rows and the number of columns.

In [43]:
df = pd.DataFrame({"Name": ["Honey", "Bunny", "Sunny"],
                   "Age" : [21,22,24],
                   "class" : ["bcom", "bsc", "btech"]
                  })
df.shape

(3, 3)

In [44]:
df.size

9

Q6. Which function of pandas do we use to read an excel file?

In [ ]:
#Answer 
# To read excel file we use
pd.read_excel("file name")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [45]:
#Answer
df = pd.DataFrame({"Email" : ["honey1@gmail.com", "ayush05@gmail.com", "akash9060@gmail.com"]})
df

                 Email
0     honey1@gmail.com
1    ayush05@gmail.com
2  akash9060@gmail.com

In [48]:
df["Username"] = df["Email"].apply(lambda x: x.split('@')[0])
df

                 Email   Username
0     honey1@gmail.com     honey1
1    ayush05@gmail.com    ayush05
2  akash9060@gmail.com  akash9060

In [ ]:
Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
  A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [49]:
#Answer
df = pd.DataFrame({"A": [3,8,6,2,9],
             "B": [5,2,9,3,1],
             "C" : [1,7,4,5,2]})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [50]:
def select(df):
    df1 = df[(df['A']>5) & (df['B']<10)]
    return df1

In [51]:
df1 = select(df)
df1

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [52]:
#Answer
def stats(df):
    mean = df['Values'].mean()
    med = df['Values'].median()
    st = df['Values'].std()
    print(f'mean = {mean} \nmedian = {med} \nstandard deviation = {st}')
df = pd.DataFrame({'Values':[10,20,30,40,50]})

stats(df)

mean = 30.0
median = 30.0
standard deviation = 15.811388300841896

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [53]:
#Answer
df = pd.DataFrame({'Sales':[10,20,30,40,50,60,70], 'Date':pd.date_range(start = '2023-12-23', periods=7)})
df

   Sales       Date
0     10 2023-12-23
1     20 2023-12-24
2     30 2023-12-25
3     40 2023-12-26
4     50 2023-12-27
5     60 2023-12-28
6     70 2023-12-29

In [54]:
def mov_avg(df):
    df['MovingAverage'] = df['Sales'].rolling(window = 7, min_periods=1).mean()
    
df = pd.DataFrame({'Sales':[10,20,30,40,50,60,70], 'Date':pd.date_range(start = '2023-12-23', periods=7)})

mov_avg(df)
df

   Sales       Date  MovingAverage
0     10 2023-12-23           10.0
1     20 2023-12-24           15.0
2     30 2023-12-25           20.0
3     40 2023-12-26           25.0
4     50 2023-12-27           30.0
5     60 2023-12-28           35.0
6     70 2023-12-29           40.0

In [ ]:
Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the
DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' 
column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [55]:
#Answer
date = pd.date_range(start = '2023-01-01', end = '2023-01-05')
date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05'],
              dtype='datetime64[ns]', freq='D')

In [56]:
df = pd.DataFrame({'Date' : date})
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [57]:
df['Weekday'] = df['Date'].dt.day_name()
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [58]:
#Answer

def select_rows_in_date_range(df, start_date, end_date):
    # Convert the 'Date' column to datetime if it's not already
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Create a boolean mask to select rows within the date range
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    
    # Use the mask to filter the DataFrame
    selected_rows = df[mask]
    
    return selected_rows

# Example usage:
data = {'Date': ['2023-01-15', '2023-01-20', '2023-02-05', '2023-01-10']}
df = pd.DataFrame(data)

# Call the function to select rows in the specified date range
start_date = '2023-01-01'
end_date = '2023-01-31'
selected_df = select_rows_in_date_range(df, start_date, end_date)

print(selected_df)

        Date
0 2023-01-15
1 2023-01-20
3 2023-01-10

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [59]:
#Answer
import pandas as pd